import React, { PureComponent } from 'react';
import './index.css';

class TermsAndConditionText extends PureComponent {
  render() {
    const { fullHeight } = this.props;

    return (
      <div className={fullHeight ? 'terms-wrapper-full-height' : 'terms-wrapper'}>
        <h3 className="terms-title">الف) شرایط عمومی</h3>
        <div>
          <ul className="ul-terms">
            <li className="li-terms">
              کلیه حقوق نشان پاداسپیس و نام‌های «پاداسپیس» و "PodSpace" متعلق به پاداسپیس هستند.
            </li>
            <li className="li-terms">
              در صورت استفاده از خدمات پاداسپیس، کاربران به صورت ضمنی موافقت خود را با شرایط استفاده اعلام نموده و
              مقید به اجرای مفاد آن خواهند بود.
            </li>
            <li className="li-terms">
              در صورتی که کاربری نماینده یک سازمان باشد، این موافقت معطوف به سازمان متبوع بوده و
              باید مجوزهای لازم را از طرف سازمان مربوطه خود داشته باشد که در این صورت تمامی
              خطاب‌های مطالب آتی متوجه آن سازمان خواهد بود.
            </li>
            <li className="li-terms">
              کاربران نباید هیچ‌گونه منع قضایی یا قانونی در استفاده از خدمات فضای ابری و پاداسپیس داشته باشند. لذا باید
              صلاحیت، قدرت و اختیار کامل را برای پذیرش این تعهد داشته باشند؛ در غیر اینصورت هیچگونه
              مسوولیتی متوجه سرزمین هوشمند پاد و پاداسپیس نخواهد بود.
            </li>
            <li className="li-terms">
              ممکن است علاوه بر شرایط عمومی خدمات پاداسپیس، دیگر خدمات پاداسپیس شرایط خاص خود را داشته
              باشند که در این صورت شما باید آنها را بپذیرید و در صورت وجود تفاوت میان شرایط عمومی و
              شرایط اختصاصی خدمات، اولویت با شرایط اختصاصی خواهد بود.
            </li>
            <li className="li-terms">
              کاربران با ثبت‌نام در پاداسپیس و استفاده از خدمات آن این اجازه را به سرزمین هوشمند پاد می‌دهند که کاربر و یا
              سازمان متبوع را به عنوان مشتری در سایت و دیگر روش‌های تبلیغاتی خود معرفی نموده و از
              لوگو و نام تجاری این سازمان در حد عرف در جهت معرفی مشتریان خود استفاده نماید.
            </li>
            <li className="li-terms">
              پاداسپیس خدمات خود را به صورت مستقیم یا از طریق اپراتورهای تلفن همراه یا اینترنت (نظیر
              ایرانسل، همراه اول و …) به کاربران عرضه می‌کند. در صورتی که خدمات پاداسپیس از طریق
              اپراتور به مشترکان وی عرضه شود، مالکیت مادی و معنوی کلیه زیرساخت‌ها و راهکارهای
              اپراتوری که در ارتباط با پاداسپیس هستند، متعلق به اپراتور بوده و پاداسپیس به جز برای
              ارائه خدمات توافق شده از این راهکارها استفاده‌ای نمی‌کند و تضمین و مسوولیتی نیز بابت
              عملکرد آنها ندارد. اپراتور نیز ادعای مالکیت و یا مسوولیتی در قبال زیرساخت و کلاینت‌های
              پاداسپیس و عملکرد آنها ندارد. لذا، مسوولیت پشتیبانی از اطلاعات کاربران و حفظ آنها بر
              عهده پاداسپیس بوده و اپراتور مسوولیتی در این خصوص ندارد. همچنین تیم پشتیبانی پاداسپیس
              بابت سوالات و مشکلات کاربران در استفاده از خدمات ارائه شده توسط زیرساخت‌ها و
              کلاینت‌های پاداسپیس پاسخگو بوده و پاسخگویی در خصوص زیرساخت‌ها و راهکارهای اپراتوری در
              حیطه وظایف اپراتور است. در هر حالتی نیز، پاداسپیس و اپراتور هیچگونه مسوولیتی در رابطه
              با محتوای بارگذاری شده و بازنشر داده شده توسط کاربر نداشته و تمامی مسوولیت‌ها در این
              خصوص بر عهده کاربر است.
            </li>
            <li className="li-terms">
              پاداسپیس ممکن است شرایط خدمات و سیاست‌های خود را اصلاح کرده، تغییر داده یا متوقف
              نماید. در این صورت از قبل از طریق همین صفحه به شما اطلاع داده می‌شود.
            </li>
            <li className="li-terms">
              اتصالات اینترنتی که از پاداسپیس به دیگر وب‌سایت‌ها و منابع وجود دارد به هیچ عنوان
              تایید کننده کیفیت، خدمات، محصولات و امنیت آنها نیست. شما باید با درنظر گرفتن شرایط و
              معیارهای خود از خدمات دیگر سرویس‌دهنده استفاده کنید.
            </li>
          </ul>
        </div>

        <h3 className="terms-title">ب) خدمات پاداسپیس</h3>
        <div>
          <ul className="ul-terms">
            <li className="li-terms">
              خدمات پاداسپیس تابع قوانین جمهوری اسلامی ایران به خصوص قانون تجارت الکترونیکی بوده و
              طبق این قوانین تفسیر می‌شوند. هرگونه دعوی و حکم قضایی صرفا از طریق دادگاه‌ها و مجاری
              قانونی ایران قابل پیگیری است.
            </li>
            <li className="li-terms">
              همه قوانین مذکور به ویژه مواد ۶۲، ۶۴، ۷۴ و ۷۵ قانون تجارت الکترونیک، در خصوص حمایت از
              حقوق مولفان، ناشران، مصنفان و هنرمندان و پدیدآورندگان نرم‌افزارهای رایانه‌ای، حمایت از
              حقوق مالکیت‌های فکری در بستر مبادلات الکترونیکی، و حمایت از اسرار تجاری یا شغلی، بر
              استفاده کننده از خدمات ما نافذ بوده و نقض هر یک از این قوانین، مجرمانه و قابل پیگیری
              خواهد بود.
            </li>
            <li className="li-terms">
              خدمات می‌توانند با افزودن امکانات و ویژگی‌های جدید در طول زمان تغییر کنند. این تغییرات
              به قسمی خواهند بود که سرویس اصلی تعهد شده به شما را دچار مشکل نکنند.
            </li>
            <li className="li-terms">
              پاداسپیس اطلاعات شما را حداکثر تا یک ماه پس از اتمام قرارداد شما نگهداری می‌کند و پس
              از آن، آنها را حذف می‌کند. شما موظف هستید پس از اتمام قرارداد اطلاعات خود را از
              پاداسپیس به حافظه دیگری منتقل کنید. در غیر اینصورت هیچ‌گونه مسوولیتی برعهده ما نخواهد
              بود.
            </li>
            <li className="li-terms">
              نگهداری رمز عبور بر عهده شماست. همچنین افشای این رمز به هر کسی به‌منزله مجوز دسترسی به
              تمامی داده‌های شما خواهد بود.
            </li>
            <li className="li-terms">
              پاداسپیس مسوول نگهداری اطلاعات شما بوده و آنها را به صورت امن نگهداری می‌کند. لیکن با
              اثبات کارکرد صحیح نرم‌افزارها و سیستم‌ها، پاداسپیس هیچ وظیفه‌ای در قبال بازگردانی
              اطلاعات شما نخواهد داشت. به این معنی که در صورت خرابی منبع داده‌ها یا سوء استفاده از
              محصولات و خدمات و دیگر مواردی که در راهنماهای کاربری و قوانین و شرایط استفاده ما توضیح
              داده نشده، هرگونه مشکلات احتمالی برعهده خود شما خواهد بود. بنابراین، خواهشمندیم مطابق
              مستندات پاداسپیس و با راهنمایی‌های پاسخ‌گویی فنی پاداسپیس از خدمات پاداسپیس استفاده
              نمایید.
            </li>
          </ul>
        </div>

        <h3 className="terms-title">ج) امنیت، حریم خصوصی و مالکیت</h3>
        <div>
          <ul className="ul-terms">
            <li className="li-terms">
              پاداسپیس از روش‌های حفاظتی و امنیتی کارا برای ایجاد امنیت در سامانه‌های سخت‌افزاری و
              نرم‌افزاری و روش‌های ارتباطی خود استفاده می‌کند. لیکن هرگونه نقاط ضعف امنیتی که با
              استفاده از فناوری‌ها و دانش روز موجود در کشور نتوان آن را برطرف نمود، از عهده پاداسپیس
              خارج بوده و در صورت بروز اشکالاتی از دست،این گونه موارد همانند قوای قهریه خارج از
              قرارداد و خدمات پاداسپیس است، از جمله این موارد: نقاط ضعف علمی الگوریتم‌های کدگذاری،
              حفره‌های امنیتی سیستم‌عامل‌ها، حفره‌های امنیتی سرورهای نرم‌افزاری، اشکالات ساختاری
              شبکه‌های کامپیوتری، و دیگر نقاط ضعف عمومی شبکه‌های کامپیوتری.
            </li>
            <li className="li-terms">
              فایل‌ها و داده‌هایی که کاربران در پاداسپیس قرار می‌دهند (که در مجموع «اطلاعات کاربران» یا
              «محتوا» خوانده می‌شود) متعلق به کاربران بوده و پاداسپیس در هیچ زمانی، هیچ‌گونه ادعایی نسبت به
              مالکیت آنها نخواهد داشت.
            </li>
            <li className="li-terms">
              در صورتی که برای عرضه خدمات پاداسپیس، نیاز به دسترسی به اطلاعات کاربران باشد، کاربران پیشاپیش
              با درخواست خود، این مجوز را داده‌اند. این مجوز با تضمین پاداسپیس، به همکاران پاد که خدمات پاداسپیس
              را تامین و گسترش می‌دهند نیز تسری پیدا خواهد کرد.
            </li>
            <li className="li-terms">
              به جز موارد استثنایی که در قوانین پاداسپیس توضیح داده شده، و حکم قضایی صریح، پاداسپیس تضمین
              می‌کند که اطلاعات کاربران را در اختیار غیر یا سامانه‌ها و وب‌سایت‌های دیگر قرار ندهد،
              مگر آنکه خود کاربران درخواست کنند. این درخواست ممکن است در قالب استفاده از سرویس‌های پاداسپیس
              برای دیگر سامانه‌ها باشد (مثل انتقال اطلاعات کاربران به دیگر فضاهای ابری).
            </li>
          </ul>
        </div>

        <h3 className="terms-title">د) نرم‌افزارهای پاداسپیس</h3>
        <div>
          <ul className="ul-terms">
            <p>
              از آنجا که امنیت بی‌حد و مرز است، برای شفافیت خدمات پاداسپیس، موارد زیر باید مدنظر قرار
              گرفته شود:
            </p>
            <li className="li-terms">
              برخی از خدمات ما نیازمند نصب نرم‌افزار بر روی دستگاه‌های شما است. این نرم‌افزارها
              اختصاصا برای استفاده از خدمات پاداسپیس ساخته شده‌اند و استفاده از آنها به غیر از
              مواردی که پاداسپیس مشخص می‌کند ممنوع است. این نرم‌افزارها جزء دارایی‌های پاداسپیس بوده
              و به شما به صورت موقت و غیر انحصاری و غیر تضمینی امکان استفاده از آنها داده شده است.
            </li>
            <li className="li-terms">
              تمام حقوق این نرم‌افزارها متعلق به پاداسپیس بوده و شما به هیچ وجه مجاز به مهندسی
              معکوس، بازکردن و استخراج متن برنامه، استفاده از تصاویر و محتویات استفاده شده در برنامه
              برای بهره‌برداری‌های دیگر نیستید. در غیر این صورت پاداسپیس می‌تواند شما را مورد پیگرد
              قرار دهد.
            </li>
            <li className="li-terms">
              نرم‌افزارهای پاداسپیس ممکن است به صورت خودکار اطلاعاتی را از/به پاداسپیس منتقل نماید.
              ما تضمین می‌کنیم هیچ‌گونه اطلاعاتی از دستگاه شما بدون اطلاع و تأیید شما منتقل، دستکاری
              یا حذف نگردد.
            </li>
            <li className="li-terms">
              در صورتی که پاداسپیس نرم‌افزار شخص ثالثی را به شما پیشنهاد نماید، هیچ‌گونه مسوولیتی را
              در قبال این برنامه‌ بر عهده نداشته و این صرفا یک پیشنهاد تخصصی است که شما مجاز هستید
              آن را قبول یا رد کنید.
            </li>
          </ul>
        </div>

        <h3 className="terms-title">ه) وظایف شما</h3>
        <div>
          <ul className="ul-terms">
            <li className="li-terms">
              شما باید قوانین پاداسپیس را رعایت کنید و از هر گونه سوء استفاده خودداری کنید.
            </li>
            <li className="li-terms">
              شما متعهد هستید که همه اطلاعات عرضه شده به پاداسپیس برای ثبت‌نام، صحیح و متعلق به شخص
              خودتان باشد. همچنین هر زمان که اطلاعات شما تغییر کند، باید اطلاعات خود را به روز کنید.
            </li>
            <li className="li-terms">
              شما تعهد می‌دهید که برای پذیرش این قرارداد و شرایط و اجرای آن، صلاحیت، اهلیت، قدرت و
              اختیار کامل دارید.
            </li>
            <li className="li-terms">
              شما متعهد می‌شوید که از خدمات پاداسپیس صرفا در چارچوب ضوابط و شرایط پاداسپیس و در مقام
              بالاتر، از قوانین و مقررات جمهوری اسلامی ایران استفاده کنید.
            </li>
            <li className="li-terms">
              شما متعهد هستید که هیچ یک از محتواهای زیر را بر روی پاداسپیس نگهداری نکنید: محتوای
              متعلق به دیگران بدون داشتن مجوز قابل قبول قانونی و ناقض قوانین حقوق تالیف‌کنندگان،
              محتوای غیرشرعی، خلاف عفت و اخلاق، محتوای مخالف با قوانین و مقررات پلیس فضای امنیت کشور
              (فتا)، محتوای طبقه‌بندی شده نظامی، محتواهای مخرب و صدمه‌زننده به پاداسپیس یا دیگران
              نظیر ویروس‌ها و نرم‌افزارهای جاسوسی.
            </li>
            <li className="li-terms">
              اقدامات پاداسپیس در قبال متخلفان موارد فوق، ممکن است شامل این امور باشد: غیرفعال کردن
              دسترسی‌های کاربر متخلف، حذف اطلاعات مذکور، و حذف کاربر متخلف با/بدون اطلاع قبلی.
            </li>
            <li className="li-terms">
              شما مسوول تمام فعالیت‌هایی خواهید بود که تحت نام کاربری شما انجام می‌شود، لذا حفظ
              امنیت رمز عبورتان بسیار مهم است. همچنین شما موظف هستید از یک اتصال امن اینترنتی برای
              استفاده از خدمات ما بهره ببرید. در صورتی که به سبب رعایت نکردن این موارد، هرگونه
              صدمه‌ای به شما وارد شود، مسوولیت آن بر عهده خود شما خواهد بود.
            </li>
            <li className="li-terms">
              انتخاب رمز عبور مناسب اهمیت فراوانی دارد. بنابراین، رمز مناسبی از جهت اندازه و تنوع
              نشانه‌ها انتخاب نمایید. ما پیشنهاد می‌کنیم رمز انتخابی دست کم ۸ نشانه باشد که در آن
              حروف کوچک و بزرگ، عدد و نشانه‌های خاص وجود داشته و به آسانی بتوانید آن را به خاطر
              بسپارید.
            </li>
            <li className="li-terms">
              شما متعهد می‌شوید که تنها خودتان از خدمات پاداسپیس استفاده کنید و حق فروش، کپی، یا
              بازنشر آنها را ندارید.
            </li>
            <li className="li-terms">
              شما متعهد می‌شوید که به صورت مستقیم یا غیرمستقیم اقدامی که به منافع مادی و معنوی
              پاداسپیس لطمه وارد نماید مرتکب نشوید.
            </li>
            <li className="li-terms">
              شما متعهد می‌شوید که به هیچ وجه از خدمات ما برای ارتباط غیرمجاز با دیگران، اقدامات
              خرابکارانه و انجام دیگر رفتارهای خلاف عرف و اخلاق استفاده نکنید.
            </li>
            <li className="li-terms"></li>
          </ul>
        </div>

        <h3 className="terms-title">و) توافق‌نامه سطح سرویس</h3>
        <div>
          <ul className="ul-terms">
            <p>
              با توجه به نوع و شرایط خدمات پاداسپیس، برای شفافیت سطح سرویس در خدمات ما، به موارد زیر
              دقت نمایید:
            </p>
            <li className="li-terms">
              حجم داده شده به شما برای نگهداری تمامی نسخه فایل‌هایی است که شما در پاداسپیس قرار
              می‌دهید.
            </li>
            <li className="li-terms">
              شاخص میزان در دسترس بودن وب‌سایت پاداسپیس حداقل به میزان ۹۸ درصد خواهد بود. معیار
              اندازه‌گیری این شاخص، تست‌ها با اتصال از طریق هر سرویس‌دهنده اینترنتی به انتخاب
              پاداسپیس و تنظیمات مجدد دستگاه مورد تست است.
            </li>
            <li className="li-terms">
              قطعی‌هایی که در ادامه توضیح داده می‌شود از مواردی است که در شاخص فوق در نظر گرفته
              نمی‌شود: قطعی‌های پیش‌بینی شده (با شرایط دست کم ۲۴ ساعت قبل از طریق ایمیل یا پیامک
              اطلاع داده شده باشد، حداکثر زمان قطعی ۶ ساعت باشد، و حداکثر یک بار در ماه باشد)،
              قطعی‌های ناشی از حوادث قهریه مثل حوادث طبیعی، قطعی‌های ناشی از قطعی سراسری شبکه‌های
              برق و اینترنت و شبکه ملی اطلاعات، قطعی‌های بین تغییر بسته‌های پاداسپیس فعال کاربر، و
              قطعی‌های به درخواست مراجع قضایی ذی‌صلاح.
            </li>
            <li className="li-terms">
              در صورتی که میزان در دسترس بودن پاداسپیس از میزان تعیین شده کمتر باشد، به ازای هر
              میزان قطعی بیش از مقدار تعیین شده، سرویس مشترک برابر آن زمان تمدید می‌شود.
            </li>
            <li className="li-terms">
              مجموع ترافیک ارسالی و دریافتی درنظر گرفته شده در پاداسپیس، محدود است.
              درصورتی که کاربری از این میزان تجاوز کند، ممکن است دچار محدودیت دسترسی یا پرداخت هزینه
              بیشتر یا کسر از ترافیک ماه‌های آتی شود.
            </li>
          </ul>
        </div>
      </div>
    );
  }
}

export default TermsAndConditionText;
